<h1>Практическая 3</h1>
<h2>Задача 1</h2>
<?php
$a = 5;
$b = 10;
// вывод исходных данных на экран
echo "Переменная a = " . $a . "<br>";
echo "Переменная b = " . $b . "<br>";
if ($a < $b) {
    echo $a + $b; // Если a меньше b,  выводим сумму 
} else {
    echo $a * $b; // Иначе выводим произведение 
}
?>
<h2>Задача 2</h2>
<?php
$angle1 = 60;
$angle2 = 30;
// вывод данных на экран
echo "Первый угол = " . $angle1 . "<br>";
echo "Второй угол = " . $angle2 . "<br>";
// сумма углов должна быть строго меньше 180,  а сами углы больше 0
if (($angle1 + $angle2) < 180 && $angle1 > 0 && $angle2 > 0) {
    echo "Треугольнки существует.";
    $angle3 = 180 - $angle1- $angle2;
    if ($angle1 == 90 || $angle2 == 90 || $angle3 == 90) {
        echo "Он прямоугольный.";
    } else {
        echo "Он не прямоугольный.";
    }
} else {
    echo "Такой треугольник не существует.";
}
?>
<h2>Задача 3</h2>
<?php
$age = 5; // поменяй возраст, чтобы проверить разные группы
$ageGroup = '';
// вывод данных на жкран
echo "Возраст кота = " . $age . "<br>";
if ($age <= 1) {
    $ageGroup = 'Котята';
} elseif ($age <= 3) {
    $ageGroup = 'Молодые коты';
} elseif ($age <= 7) {
    $ageGroup = 'Коты средних лет';
} else {
    $ageGroup = 'Почтенные коты';
}
echo "Возрастная группа: " . $ageGroup;
?>
<h2>Задача 4</h2>
<?php
$a = 3;
$b = 4;
$c = 5;
// каждая сторона должна быть меньше суммы двух других 
if (($a + $b > $c) && ($a + $c > $b) && ($b + $c > $a)) {
    echo "Треугольник со сторонами $a, $b, $c существует.";
} else {
    echo "Треугольник не существует.";
} 
?>
<h2>Задача 5</h2>
<?php
$n = 2024; // проверить год
// вывод исходных на экран
echo "Проверяемый год N = " . $n . "<br>";
if ($n % 100 == 0) {
    $isLeap = ($n % 400 ==0);
} else {
    $isLeap = ($n % 4 ==0);
}
if ($isLeap) {
    echo "Результат: Год " . $n . " - високосный.";
} else {
    echo "Результат: Год " . $n . " - не високосный.";
}
?>
<h2>Задача 6</h2>
<?php
$a = 30000;
$b = 5000;
//вывод данных на экран
echo "Число A = " . $a . "<br>";
echo "Число B = " . $b . "<br>";
//проверить условие переполнения 
if (($a + $b) > 32767) {
    echo "Результат: Переполнение!" ;
} else {
    echo "Результат: Сумма равна " . ($a + $b);
}
?>