<h1>Практическая - оператор выбора</h1>
<h2>Задача 1</h2>
<?php
$digit = 5; // дали цифру 5
// создать список слов, где под каждым номером лежит слово
$words = [
    0 => "zero", 1 => "one", 2 => "two", 3 => "three", 4 => "four", 5 => "five", 6 => "six", 7 => "seven", 8 => "eight", 9 => "nine" 
]; // взять слово из списка по номеру цифры
echo $words[$digit];
?>
<h2>Задача 2</h2>
<?php
$month = 1; // вести номер месяца (1 - январь)
if ($month == 1) {
    echo "1 января - Новый год, 7 января - Рождество";
} elseif ($month == 2) {
    echo "Праздников в феврале нет"; // как пример
} else {
    echo "Праздников в этом месяце не найдено";
}
?>
<h2>Задача 3</h2>
<?php
$number = 14; 
$square = $number * $number; // считаем квадрат 
$last_digit = $square % 10;
echo "Последняя цифра квадрата: " . 
$last_digit;
?>
<h2>Задача 4</h2>
<?php
$age = 17; // возраст
// правила русского языка в коде
if ($age % 10 == 1 && $age % 100 != 11) {
    $word = "год";
} elseif ($age % 10 >= 2 && $age % 10 <= 4 && ($age % 100 < 10 || $age % 100 >= 20)) {
 $word = "Года";
} else {
    $word = "Лет";
}
echo "Мне " . $age . " " . $word;
?>